app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "Rachid Boulaoine"], ["content", "Félix lâche des caisses en codant!"], ["created_at", "2018-01-31 19:48:54.579535"], ["updated_at", "2018-01-31 19:48:54.579535"]]
---
  def create
    @gossip = Gossip.create(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 2]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy